Pandas series object : It is the one dimension array.

In [1]:
import pandas as pd 
data= pd.Series([0.25,0.35,0.45,0.55])
data

0    0.25
1    0.35
2    0.45
3    0.55
dtype: float64

In [2]:
# if we take only value not index
print(data.values)
type(data.values)

[0.25 0.35 0.45 0.55]

numpy.ndarray

In [3]:
data=pd.Series([1,2,3,4,5],index=['A','B','C','D','E'])
data

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [4]:
#If you want to extract data from particular index
data['A':'D']

A    1
B    2
C    3
D    4
dtype: int64

In [5]:
# Series by using of Dictonary
population_dict={'Delhi':50000000,
                 'Gurgoan':3000000,
                 'Faridabad':1000000,
                 'Greater Noida':100000}
series_dict=pd.Series(data=population_dict)
series_dict
series_dict['Delhi']
series_dict['Delhi':'Faridabad']

Delhi        50000000
Gurgoan       3000000
Faridabad     1000000
dtype: int64

In [6]:
#Constructing series object
pd.Series(5,index=[100,200,300])

100    5
200    5
300    5
dtype: int64

In [7]:
pd.Series({2:'a',1:'k',5:'g'},index=[5,1])

5    g
1    k
dtype: object

The Pandas dataframe object

In [8]:
population_dict={'Delhi':50000000,
                 'Gurgoan':3000000,
                 'Faridabad':1000000,
                 'Greater Noida':100000}
area_dict={'Delhi':2000000,
                 'Gurgoan':500000,
                 'Faridabad':8698000,
                 'Greater Noida':698600}
ncr=pd.DataFrame({'Population':population_dict,
                  'Area':area_dict})             # DataFrame is a two dimension series . or we can also say that it is a collection of series.
ncr

               Population     Area
Delhi            50000000  2000000
Gurgoan           3000000   500000
Faridabad         1000000  8698000
Greater Noida      100000   698600

In [9]:
ncr['Area']

Delhi            2000000
Gurgoan           500000
Faridabad        8698000
Greater Noida     698600
Name: Area, dtype: int64

In [10]:
#Construting Dataframe objects
pd.DataFrame(['Foo','Bar'],index=['A','B'],columns=["example"])

  example
A     Foo
B     Bar

In [11]:
import numpy as np
pd.DataFrame({"A":np.array([1,2,3,4]),
              "B":np.arange(0,4),
              "C":'a b c d'.split()},index=['K','L','M','N'])

   A  B  C
K  1  0  a
L  2  1  b
M  3  2  c
N  4  3  d

Data Indexing and selection

In [12]:
data=pd.DataFrame({'Humanity':['Pol','Geo'],
                   'science':['Chemistry','Phy']},index=['a','b'])
data
data['Humanity']

a    Pol
b    Geo
Name: Humanity, dtype: object

In [13]:
data['a':'b'] 
data[0:2]
data

  Humanity    science
a      Pol  Chemistry
b      Geo        Phy

In [14]:
data['Percentage Req']=[80,60]
data

  Humanity    science  Percentage Req
a      Pol  Chemistry              80
b      Geo        Phy              60

In [15]:
data[data['Percentage Req'] >70]

  Humanity    science  Percentage Req
a      Pol  Chemistry              80

Indexes : loc,iloc,ix

In [16]:
data=pd.Series(['a','b','c'],index=[1,3,5])
data
#Implimentation of iloc (Alwasys follow implicit index)
data.iloc[0]
data.iloc[0:]
#Implementation of loc ( Always follow explict index)
data.loc[1:5]

1    a
3    b
5    c
dtype: object

Data Selection in Dataframe

In [17]:
area=pd.Series({'California':423967,
                'Texas':695662,
                'Newyork':141297,
                'Illinios':149995})
pop=pd.Series({'California':3833251,
                'Texas':21448176,
                'Newyork':19651127,
                'Illinios':128821354})
df=pd.DataFrame({'Area':area,'Population':pop})
df

              Area  Population
California  423967     3833251
Texas       695662    21448176
Newyork     141297    19651127
Illinios    149995   128821354

In [18]:
df['Area'] # or we can also write this  data.Area >It not works all time .
df[['Area','Population']] # For choosing multiple columns

              Area  Population
California  423967     3833251
Texas       695662    21448176
Newyork     141297    19651127
Illinios    149995   128821354

In [19]:
df['Population'] is df.Population

True

In [20]:
# add new columns
df['Density']=df['Population']/df['Area']
df

              Area  Population     Density
California  423967     3833251    9.041390
Texas       695662    21448176   30.831318
Newyork     141297    19651127  139.076746
Illinios    149995   128821354  858.837655

In [21]:
# If we want to transpose data frame 
df.T # or df.transpose(). But change is not permenant.

              California         Texas       Newyork      Illinios
Area        4.239670e+05  6.956620e+05  1.412970e+05  1.499950e+05
Population  3.833251e+06  2.144818e+07  1.965113e+07  1.288214e+08
Density     9.041390e+00  3.083132e+01  1.390767e+02  8.588377e+02

In [22]:
df.iloc[2:,1:]

          Population     Density
Newyork     19651127  139.076746
Illinios   128821354  858.837655

In [23]:
df.loc[df.Density>100,['Population','Area']]

          Population    Area
Newyork     19651127  141297
Illinios   128821354  149995

In [24]:
# replace the value
df.iloc[0,2]=90

In [25]:
#Index alignment in Data Frame
import numpy as np
rng=np.random.RandomState(0)
A=pd.DataFrame(rng.randint(0,20,(2,2)),columns=list("AB"))
B=pd.DataFrame(rng.randint(0,10,(3,3)),columns=list("BAC"))
A+B

      A     B   C
0  19.0  18.0 NaN
1   5.0   6.0 NaN
2   NaN   NaN NaN

In [26]:
#Operation b/w dataframe and Series
A=rng.randint(10,size=(3,4))
df=pd.DataFrame(A,columns=list('QRST'))
df

   Q  R  S  T
0  8  8  1  6
1  7  7  8  1
2  5  9  8  9

In [27]:
df.subtract(df['R'],axis=0)

   Q  R  S  T
0  0  0 -7 -2
1  0  0  1 -6
2 -4  0 -1  0

In [28]:
half_row=df.iloc[0,::2]
half_row

Q    8
S    1
Name: 0, dtype: int32

**Missing Values (If there are missing value in data than it effects lot in your prediction)**

**Operation On Null Values:**

isnull() ---  To Find missing value

notnull()----- Oppiste of isnull()

dropna()------- Return filtered version of data

fillna()-----   To fill NaN value

In [29]:
#Detecting Null Value
import numpy as np
data=pd.Series([1,np.nan,'hello',None])
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [30]:
data[data.notnull()] # which don't have nan value

0        1
2    hello
dtype: object

In [31]:
#Dropping null values
data.dropna()

0        1
2    hello
dtype: object

In [32]:
df=pd.DataFrame([[1,np.nan,2],
                 [2,3,5],
                 [np.nan,4,6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [33]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [34]:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

But to drop all row we use how parameter default how='any'. 

If we want to delete whole row which has all nan value. So in that case we use how='all'.

In [35]:
df[3]=np.nan
df.dropna(how='all',axis='columns')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [36]:
#WE also use thresh =min values of nan
df.dropna(axis='rows',thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

Filling null values

In [37]:
data=pd.Series([1,np.nan,2,None,3],index=list('abcde'))
#fill nan value with zero
data.fillna(0)
#fill nan value with forwrd data
data.fillna(method='ffill')
#fill nan value with backword data
data.fillna(method='bfill')
# Replace nan value in 2d array
df.fillna(method='ffill',axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

Hierarchical Indexing

In [38]:
#Multiple indexed Series
index=[('California',2000),('California',2010),('New York',2000),('New York',2010),
       ('Texas',2000),('Texas',2010)]
population=[33871648,37253956,18976457,19378102,20851820,25145561]

pop=pd.Series(population,index=index)
index=pd.MultiIndex.from_tuples(index)
pop=pop.reindex(index) # when we need series
pd.DataFrame(pop,index=index,columns=['Population']) #when we need data frame

                 Population
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

In [39]:
# to convert below series in dataframe
pop_df=pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [40]:
# For reverse it use satck()
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [41]:
pop_df=pd.DataFrame({'Total':pop,
                     'Under 18':[9267089,9284094,4687374,4318033,5906301,6879014]})
pop_df

                    Total  Under 18
California 2000  33871648   9267089
           2010  37253956   9284094
New York   2000  18976457   4687374
           2010  19378102   4318033
Texas      2000  20851820   5906301
           2010  25145561   6879014

In [42]:
f_u18=pop_df['Under 18']/pop_df['Total']
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

Methods of MultiIndex Creation

In [43]:
df=pd.DataFrame(np.random.rand(4,2),index=[['a','a','b','b'],[1,2,1,2]],columns=['data1','data2'])
df

        data1     data2
a 1  0.322031  0.034300
  2  0.364581  0.704556
b 1  0.268807  0.757915
  2  0.877383  0.656115

In [44]:
#Explict methord for MultiIndex
pd.MultiIndex.from_arrays([['a','a','b','b'],[1,2,1,2]])
pd.MultiIndex.from_tuples((('a',1),('a',2),('b',1),('b',2)))
pd.MultiIndex.from_product([['a','b'],[1,2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [45]:
#Multi Index naming
pop.index.names=['States','Year']
pop

States      Year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [46]:
#multiIndex for columns
index=pd.MultiIndex.from_product([[2013,2014],[1,2]],names=['Year','Visits'])
columns=pd.MultiIndex.from_product([['Bob','Guido','Sue'],['Hr','Temp']],names=['subject','type'])
#mock some data
data=np.round(np.random.randn(4,6),1)
data[:,::2]*=10
data+=37
#Create data Frame
health_data=pd.DataFrame(data,index=index,columns=columns)
health_data

subject       Bob       Guido         Sue
type           Hr  Temp    Hr  Temp    Hr  Temp
Year Visits
2013 1       15.0  37.4  47.0  38.6  34.0  36.3
     2       29.0  36.4  26.0  35.4  35.0  36.7
2014 1       37.0  39.0  33.0  38.0  33.0  38.0
     2       44.0  37.3  37.0  37.8  49.0  37.0

In [47]:
#Maunupilate the data
health_data['Guido','Hr'] # here we don't use [[]] because it belongs to same data

Year  Visits
2013  1         47.0
      2         26.0
2014  1         33.0
      2         37.0
Name: (Guido, Hr), dtype: float64

In [48]:
health_data.iloc[:2,:2]

subject       Bob
type           Hr  Temp
Year Visits
2013 1       15.0  37.4
     2       29.0  36.4

In [49]:
health_data.loc[:,('Bob','Hr')] #in. loc we can use the tuple

Year  Visits
2013  1         15.0
      2         29.0
2014  1         37.0
      2         44.0
Name: (Bob, Hr), dtype: float64

In [50]:
#Rearranging MultiIndices
index=pd.MultiIndex.from_product([['a','c','b'],[1,2]])
data=pd.Series(np.random.rand(6),index=index)
data.index.names=['char','int']
data

char  int
a     1      0.128355
      2      0.220144
c     1      0.095290
      2      0.025282
b     1      0.774400
      2      0.229633
dtype: float64

In [51]:
#data['a':'b'] # It gives KEYError because keys is not arange properly.
data=data.sort_index() # or sortlevel()
data['a':'b']

char  int
a     1      0.128355
      2      0.220144
b     1      0.774400
      2      0.229633
dtype: float64

In [52]:
#Stacking or Unsatcking indices
pop.unstack(level=0) # Level(s) to unstack, can pass level name.  
pop.unstack(level=1)
pop.unstack().stack()

States      Year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

Index setting and resetting

In [53]:
pop_flat=pop.reset_index(name='population')
pop_flat

       States  Year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [54]:
#set_index()
pop_flat=pop_flat.set_index(['States',"Year"])
pop_flat

                 population
States     Year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

In [55]:
# Data Aggeregations
data_mean=health_data.mean(level='Year')
data_mean

subject   Bob        Guido         Sue
type       Hr   Temp    Hr  Temp    Hr  Temp
Year
2013     22.0  36.90  36.5  37.0  34.5  36.5
2014     40.5  38.15  35.0  37.9  41.0  37.5

In [56]:
data_mean=health_data.mean(axis=1,level='type')
data_mean

type                Hr       Temp
Year Visits
2013 1       32.000000  37.433333
     2       30.000000  36.166667
2014 1       34.333333  38.333333
     2       43.333333  37.366667

Combining Datasets: Concat and append

In [57]:
'''#Combining Dataset : Merge and join
Categories of joins
pd.merge():
one to one
many to one
many to many'''

#One to One join (Because both have common column name)
df1=pd.DataFrame({'Employee':['BoB','Jake','Lisa','Sues'],
                  'Group':['Accounting','Engg','Engg','Hr']})
df2=pd.DataFrame({'Employee':['Lisa','BoB','Sues','Jake'],
                  'Hire_date':['2014','2010','2013','2015']})
df3=pd.merge(df1,df2)
df3

  Employee       Group Hire_date
0      BoB  Accounting      2010
1     Jake        Engg      2015
2     Lisa        Engg      2014
3     Sues          Hr      2013

In [58]:
# Many to one 
df4=pd.DataFrame({'Group':['Accounting','Engg','Engg','Hr'],
                  'Supervisor':['Carly','Sumit','Sumit','Mark'],
                  })
pd.merge(df3,df4)

  Employee       Group Hire_date Supervisor
0      BoB  Accounting      2010      Carly
1     Jake        Engg      2015      Sumit
2     Jake        Engg      2015      Sumit
3     Lisa        Engg      2014      Sumit
4     Lisa        Engg      2014      Sumit
5     Sues          Hr      2013       Mark

In [59]:
#Specification of on keywords
print(pd.merge(df1,df2,on='Employee'))

  Employee       Group Hire_date
0      BoB  Accounting      2010
1     Jake        Engg      2015
2     Lisa        Engg      2014
3     Sues          Hr      2013

In [60]:
#the left_on and right_on keyword use when coloumn names are different
df3=pd.DataFrame({'Name':['BoB','Jake','Lisa','Sues'],
              'Salary':[7000,80000,120000,90000]})
pd.merge(df1,df3,left_on='Employee',right_on='Name')

  Employee       Group  Name  Salary
0      BoB  Accounting   BoB    7000
1     Jake        Engg  Jake   80000
2     Lisa        Engg  Lisa  120000
3     Sues          Hr  Sues   90000

In [61]:
#Use Drop
pd.merge(df1,df3,left_on='Employee',right_on='Name').drop('Name',axis=1)

  Employee       Group  Salary
0      BoB  Accounting    7000
1     Jake        Engg   80000
2     Lisa        Engg  120000
3     Sues          Hr   90000

In [62]:
#Specifying set Arithmetic for joins 
df6=pd.DataFrame({'Name':['Peter','Poul','Mary'],
                  'Food':['Fish','Beans','Bread']},columns=['Name','Food'])
df7=pd.DataFrame({'Name':['Mary','Joseph'],
                  'Drinks':['Wine','Beer']},columns=['Name','Drinks'])
pd.merge(df6,df7)

   Name   Food Drinks
0  Mary  Bread   Wine

In [63]:
pd.merge(df6,df7,how='inner') #Only for common one
pd.merge(df6,df7,how='outer') # All the data
pd.merge(df6,df7,how='left') # data which is present in first dataframe

    Name   Food Drinks
0  Peter   Fish    NaN
1   Poul  Beans    NaN
2   Mary  Bread   Wine

In [64]:
#Overlapping columns names :the suffixes keywords
df8=pd.DataFrame({'Name':['Bob','Jake','Lisa','Sue'],'rank':[1,2,3,4]})
df9=pd.DataFrame({'Name':['Bob','Jake','Lisa','Sue'],'rank':[3,1,4,2]})
pd.merge(df8,df9,on='Name')# Here x and y are by default suffixe

   Name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [65]:
pd.merge(df8,df9,on='Name',suffixes=['_L','_R'])

   Name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

US States Data

In [66]:
pop=pd.read_csv('datasets_17585_23072_state-population.csv')
area=pd.read_csv('datasets_17585_23072_state-areas.csv')
abbrevs=pd.read_csv('datasets_17585_23072_state-abbrevs.csv')
pop.head()
area.head()
abbrevs.head()

        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [67]:
merged=pd.merge(pop,abbrevs,how='outer',left_on='state/region',right_on='abbreviation')
merged=merged.drop('abbreviation',1)
merged.head()
merged[merged['population'].isnull()].head()

     state/region     ages  year  population state
2448           PR  under18  1990         NaN   NaN
2449           PR    total  1990         NaN   NaN
2450           PR    total  1991         NaN   NaN
2451           PR  under18  1991         NaN   NaN
2452           PR    total  1993         NaN   NaN

In [68]:
merged.loc[merged['state'].isnull(),'state/region'].unique() # it gives me that in which state column is empty and then gives me state/region data withrespect to state.
merged.loc[merged['state/region']=='PR','state']='Puerto Rice' 
merged.loc[merged['state/region']=='USA','state']='United State'
merged.tail()

     state/region     ages  year   population         state
2539          USA    total  2010  309326295.0  United State
2540          USA  under18  2011   73902222.0  United State
2541          USA    total  2011  311582564.0  United State
2542          USA  under18  2012   73708179.0  United State
2543          USA    total  2012  313873685.0  United State

In [69]:
final=pd.merge(merged,area,on='state',how='left')
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [70]:
final.isnull().any()

state/region     False
ages             False
year             False
population        True
state            False
area (sq. mi)     True
dtype: bool

eval() and query() is High Performance

In [71]:
data2010=final.query("year==2010 & ages=='total'") 
data2010.head()

    state/region   ages  year  population       state  area (sq. mi)
3             AL  total  2010   4785570.0     Alabama        52423.0
91            AK  total  2010    713868.0      Alaska       656425.0
101           AZ  total  2010   6408790.0     Arizona       114006.0
189           AR  total  2010   2922280.0    Arkansas        53182.0
197           CA  total  2010  37333601.0  California       163707.0

In [72]:
data2010.set_index(data2010['state'],inplace=True)
density=data2010['population']/data2010['area (sq. mi)']
density.sort_values(ascending=False,inplace=True)
density.head()

state
District of Columbia    8898.897059
New Jersey              1009.253268
Rhode Island             681.339159
Connecticut              645.600649
Massachusetts            621.815538
dtype: float64

Aggregation and Grouping

In [73]:
titanic= pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv",
                           sep='\t')   
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

In [74]:
titanic.groupby('Sex')[['Survived']].mean()

        Survived
Sex
female  0.714286
male    0.140000

In [75]:
titanic.groupby(['Sex','Pclass'])['Survived'].mean().unstack()

Pclass         1         2         3
Sex
female  1.000000  0.916667  0.571429
male    0.142857  0.166667  0.131148

In [76]:
#pivot table
titanic.pivot_table('Survived',index='Sex',columns='Pclass',aggfunc='sum',)

Pclass  1   2   3
Sex
female  9  11  20
male    3   3   8

In [77]:
Age=pd.cut(titanic['Age'],[0,10,80])
titanic.pivot_table('Survived',['Sex',"Age"],'Pclass')

Pclass         1    2    3
Sex    Age
female 2.0   NaN  NaN  0.0
       3.0   NaN  1.0  NaN
       4.0   NaN  NaN  1.0
       5.0   NaN  1.0  NaN
       8.0   NaN  NaN  0.0
...          ...  ...  ...
male   59.0  NaN  NaN  0.0
       65.0  0.0  NaN  NaN
       66.0  NaN  0.0  NaN
       70.5  NaN  NaN  0.0
       71.0  0.0  NaN  NaN

[77 rows x 3 columns]

In [78]:
# for automatic rangeing
Fare=pd.qcut(titanic['Fare'],2)
titanic.pivot_table('Survived',['Sex','Age'],['Fare','Pclass'])

Fare        6.7500   6.9750   7.0500   7.1417   7.2292   7.2500   7.6500    \
Pclass             3        3        3        3        3        3        3
Sex    Age
female 2.0       NaN      NaN      NaN      NaN      NaN      NaN      NaN
       3.0       NaN      NaN      NaN      NaN      NaN      NaN      NaN
       4.0       NaN      NaN      NaN      NaN      NaN      NaN      NaN
       5.0       NaN      NaN      NaN      NaN      NaN      NaN      NaN
       8.0       NaN      NaN      NaN      NaN      NaN      NaN      NaN
...              ...      ...      ...      ...      ...      ...      ...
male   59.0      NaN      NaN      NaN      NaN      NaN      0.0      NaN
       65.0      NaN      NaN      NaN      NaN      NaN      NaN      NaN
       66.0      NaN      NaN      NaN      NaN      NaN      NaN      NaN
       70.5      NaN      NaN      NaN      NaN      NaN      NaN      NaN
       71.0      NaN      NaN      NaN      NaN      NaN      NaN      NaN

Fare        7.7500   7.7958   7.8000    ... 71.2833  73.5000  76.7292   \
Pclass             3        3        3  ...        1        2        1
Sex    Age                              ...
female 2.0       NaN      NaN      NaN  ...      NaN      NaN      NaN
       3.0       NaN      NaN      NaN  ...      NaN      NaN      NaN
       4.0       NaN      NaN      NaN  ...      NaN      NaN      NaN
       5.0       NaN      NaN      NaN  ...      NaN      NaN      NaN
       8.0       NaN      NaN      NaN  ...      NaN      NaN      NaN
...              ...      ...      ...  ...      ...      ...      ...
male   59.0      NaN      NaN      NaN  ...      NaN      NaN      NaN
       65.0      NaN      NaN      NaN  ...      NaN      NaN      NaN
       66.0      NaN      NaN      NaN  ...      NaN      NaN      NaN
       70.5      0.0      NaN      NaN  ...      NaN      NaN      NaN
       71.0      NaN      NaN      NaN  ...      NaN      NaN      NaN

Fare        77.2875  79.2000  80.0000  82.1708  83.4750  247.5208 263.0000
Pclass             1        1        1        1        1        1        1
Sex    Age
female 2.0       NaN      NaN      NaN      NaN      NaN      NaN      NaN
       3.0       NaN      NaN      NaN      NaN      NaN      NaN      NaN
       4.0       NaN      NaN      NaN      NaN      NaN      NaN      NaN
       5.0       NaN      NaN      NaN      NaN      NaN      NaN      NaN
       8.0       NaN      NaN      NaN      NaN      NaN      NaN      NaN
...              ...      ...      ...      ...      ...      ...      ...
male   59.0      NaN      NaN      NaN      NaN      NaN      NaN      NaN
       65.0      NaN      NaN      NaN      NaN      NaN      NaN      NaN
       66.0      NaN      NaN      NaN      NaN      NaN      NaN      NaN
       70.5      NaN      NaN      NaN      NaN      NaN      NaN      NaN
       71.0      NaN      NaN      NaN      NaN      NaN      NaN      NaN

[77 rows x 82 columns]

In [79]:
titanic.pivot_table(index='Sex',columns='Pclass',aggfunc={'Survived':'sum',
                                                         'Fare':'mean'})

           Fare                     Survived
Pclass        1        2          3        1   2   3
Sex
female  90.0074  21.3250  15.080834        9  11  20
male    74.9996  25.2162  12.498633        3   3   8

In [80]:
titanic.pivot_table('Survived',index='Sex',columns='Pclass',margins=True) # compute total among each grouping default name is All

Pclass         1         2         3       All
Sex
female  1.000000  0.916667  0.571429  0.714286
male    0.142857  0.166667  0.131148  0.140000
All     0.400000  0.466667  0.291667  0.346154

In [82]:
# vectorized string operations
'''When we want to use some string function in pandas dataframe and series directly than it gives Error .
so,To use them firstly we convert them to string then call the function
Example of these methords:
len() , lower(), translate(),islower(),upper(),startswith(),isupper(),find(),isnumeric(), split(),strip(),lstrip(),rstrip()
istitle(),capitalize(),partition() '''

'When we want to use some string function in pandas dataframe and series directly than it gives Error .\nso,To use them firstly we convert them to string then call the function\nExample of these methords:\nlen() , lower(), translate(),islower(),upper(),startswith(),isupper(),find(),isnumeric(), split(),strip(),lstrip(),rstrip()\nistitle(),capitalize(),partition() '

In [83]:
data=pd.Series(['Gram Chapman','Jonh','Rocky','Sumit'])
data.str.lower()

0    gram chapman
1            jonh
2           rocky
3           sumit
dtype: object

In [84]:
data.str.startswith('R')

0    False
1    False
2     True
3    False
dtype: bool

In [85]:
data.str[0:3]

0    Gra
1    Jon
2    Roc
3    Sum
dtype: object

In [86]:
data.str.split().str.get(-1)

0    Chapman
1       Jonh
2      Rocky
3      Sumit
dtype: object

In [87]:
# Work with Time Series

In [88]:
from datetime import datetime
datetime(year=2015,month=7,day=4)

datetime.datetime(2015, 7, 4, 0, 0)

In [89]:
from dateutil import parser
date=parser.parser("4th of July,2015")
date

In [90]:
# Typed arrays of times :Numpy datetime64
import numpy as np
date=np.array('2015-07-04',dtype=np.datetime64)
date

array('2015-07-04', dtype='datetime64[D]')

In [91]:
date+np.arange(12)

array(['2015-07-04', '2015-07-05', '2015-07-06', '2015-07-07',
       '2015-07-08', '2015-07-09', '2015-07-10', '2015-07-11',
       '2015-07-12', '2015-07-13', '2015-07-14', '2015-07-15'],
      dtype='datetime64[D]')

In [92]:
np.datetime64('12-04-07 12:00')

numpy.datetime64('0012-04-07T12:00')

In [93]:
#datetime in pandas
date=pd.to_datetime('4th of July ,2015')
date

Timestamp('2015-07-04 00:00:00')

In [94]:
date.strftime('%A') # to know about the day

'Saturday'

In [95]:
dates=pd.to_datetime([datetime(2015,7,3),'4th of July,2015','2015-Jul-6','07-07-2015','2015-07-08'])

In [96]:
dates

DatetimeIndex(['2015-07-03', '2015-07-04', '2015-07-06', '2015-07-07',
               '2015-07-08'],
              dtype='datetime64[ns]', freq=None)

In [97]:
dates.to_period('D')

PeriodIndex(['2015-07-03', '2015-07-04', '2015-07-06', '2015-07-07',
             '2015-07-08'],
            dtype='period[D]', freq='D')

In [98]:
dates-dates[0]

TimedeltaIndex(['0 days', '1 days', '3 days', '4 days', '5 days'], dtype='timedelta64[ns]', freq=None)

In [100]:
#Regular Sequences pd.date_range
# pd.date_range() timestamps
#pd.period_range() periods
#pd.timedelta_range()  timedeltas
pd.date_range('2015-07-03','2015-07-10')

DatetimeIndex(['2015-07-03', '2015-07-04', '2015-07-05', '2015-07-06',
               '2015-07-07', '2015-07-08', '2015-07-09', '2015-07-10'],
              dtype='datetime64[ns]', freq='D')

In [102]:
pd.date_range('2015-07-03',periods=8,freq='H')

DatetimeIndex(['2015-07-03 00:00:00', '2015-07-03 01:00:00',
               '2015-07-03 02:00:00', '2015-07-03 03:00:00',
               '2015-07-03 04:00:00', '2015-07-03 05:00:00',
               '2015-07-03 06:00:00', '2015-07-03 07:00:00'],
              dtype='datetime64[ns]', freq='H')

In [103]:
pd.period_range('2015-07',periods=8,freq='M')

PeriodIndex(['2015-07', '2015-08', '2015-09', '2015-10', '2015-11', '2015-12',
             '2016-01', '2016-02'],
            dtype='period[M]', freq='M')

In [104]:
pd.timedelta_range(0,periods=10,freq='H')

TimedeltaIndex(['00:00:00', '01:00:00', '02:00:00', '03:00:00', '04:00:00',
                '05:00:00', '06:00:00', '07:00:00', '08:00:00', '09:00:00'],
               dtype='timedelta64[ns]', freq='H')

In [106]:
date=pd.date_range('2015-07-08',periods=12)

df=pd.DataFrame(date,columns=['dates'])
df

        dates
0  2015-07-08
1  2015-07-09
2  2015-07-10
3  2015-07-11
4  2015-07-12
5  2015-07-13
6  2015-07-14
7  2015-07-15
8  2015-07-16
9  2015-07-17
10 2015-07-18
11 2015-07-19

In [129]:
df['dates']=df['dates']=pd.to_datetime(df['dates']) # df['dates'].astype('strftime('datetime64[ns]')
df.dates.dt.strftime('%A')

0     Wednesday
1      Thursday
2        Friday
3      Saturday
4        Sunday
5        Monday
6       Tuesday
7     Wednesday
8      Thursday
9        Friday
10     Saturday
11       Sunday
Name: dates, dtype: object

In [ ]:
''' To do any thing in datetime date you need to do in datetime variable than you can use in the dateframe'''

In [ ]:
# high performance pandas :eval() and query()
#eval(): use string expression to efficiently compute operations using DataFrame

In [1]:
import pandas as pd
import numpy as np
nrows,ncols=10000,10
rng=np.random.RandomState(42)
df1,df2,df3,df4=(pd.DataFrame(rng.rand(nrows,ncols)) for i in range(4))

In [2]:
pd.eval("df1+df2+df3+df4")

,0,1,2,3,4,5,6,7,8,9
0,1.394961,2.031871,1.320186,2.012198,1.608731,1.400742,1.813025,2.572728,2.120290,1.574693
1,0.843658,2.475051,1.989191,1.771753,0.749306,1.830378,2.231835,2.151813,1.691947,1.733039
2,2.243999,0.944804,2.493574,1.954129,1.736720,1.266137,2.030434,2.261136,1.859521,0.968853
3,1.828116,1.447915,1.803142,2.914933,2.747341,2.239152,1.957365,1.657475,3.495063,1.740776
4,1.771324,2.051223,2.232542,1.721733,1.762023,2.789994,1.884263,1.981789,1.102234,1.763821
...,...,...,...,...,...,...,...,...,...,...
9995,1.201133,1.991777,1.424696,2.209505,1.229654,2.652873,1.635797,1.981820,2.016932,1.346442
9996,1.486776,1.756934,1.204384,2.041802,2.168530,1.481753,1.725054,2.220356,1.375964,1.848085
9997,1.267650,1.305531,2.450521,1.153611,2.665035,1.554132,2.338643,1.861592,2.477429,1.756233
9998,1.932355,2.912529,2.665858,2.112308,2.735577,0.606667,1.936694,2.650661,2.062109,2.186801
9999,3.342934,1.331656,2.644253,1.558752,2.453907,2.257414,2.306633,2.068907,2.093520,1.597968

In [3]:
#for check both of them are equal or not
np.allclose(df1+df2+df3+df4,pd.eval("df1+df2+df3+df4"))

True

In [4]:
# More Examples
df1,df2,df3,df4,df5=(pd.DataFrame(rng.randint(0,100,(100,3))) for i in range(5))

In [5]:
result1= -df1*df2/(df3+df4)-df5
result2=pd.eval('-df1*df2/(df3+df4)-df5')
np.allclose(result1,result2)

True

In [7]:
result=pd.eval('(df1<0.5) and (df2<0.5) or (df3<df4)')
result

        0      1      2
0   False   True  False
1   False  False  False
2    True   True   True
3    True   True  False
4   False   True   True
..    ...    ...    ...
95  False   True  False
96  False  False   True
97   True  False   True
98  False   True  False
99  False   True  False

[100 rows x 3 columns]

In [ ]:
#DataFrame.eval() Example
df=pd.DataFrame(rng.rand(1000,3),columns=['A','B','c'])
df.eval('D=(A+B)/(c-1)')

In [11]:
column_mean=df.mean(1)
result1=df.eval('A+@column_mean') # We use @ where the variable nmae is rather than column name
result1

0      1.122472
1      0.845401
2      1.679928
3      1.519699
4      0.854597
         ...
995    1.525506
996    0.616006
997    0.605822
998    0.283871
999    1.672314
Length: 1000, dtype: float64

In [12]:
#DataFrame.query() Examples
#query()  Based on evaluated string. 
result1=df.query(" A<0.5 and B<0.5")
result1

            A         B         c
4    0.315168  0.372663  0.930454
5    0.328651  0.450374  0.471677
6    0.095589  0.066500  0.311925
10   0.062749  0.258533  0.296922
11   0.292555  0.298186  0.282043
..        ...       ...       ...
986  0.365089  0.125249  0.632093
988  0.300788  0.064656  0.591128
991  0.419933  0.325254  0.953250
993  0.087469  0.274178  0.531648
998  0.174213  0.129587  0.025172

[239 rows x 3 columns]

In [15]:
cmean=df['c'].mean()
result1=df[(df['A']<cmean) & (df['B']<cmean)]
result2=df.query(" A<@cmean and B<@cmean")
np.allclose(result1,result2)

True

In [ ]:
                                      # Thanks for looking.